Repository: lidavidm/lidavidm.github.com
Catalog: i18n/*.po
Languages: cs

source: Main Page
cs: Hlavní stránka

source: Download
cs: Stáhnout

source: Documentation
cs: Dokumentace

source: Support
cs: Podpora

source: Screenshots
cs: Screenshoty

source: Development
cs: Vývoj

source: Online Shell
cs: Online Konzole

source: This page is open source. Fork <a href="%(url)s">the project on GitHub</a> to edit it.
cs: Tato stránka je open source. Založte fork <a href="%(url)s">projektu na GitHubu</a> k její editaci.

source: Languages
cs: Jazyky

source: We are interested in any contribution. There are many ways how you can contribute
cs: Máme zájem o jakoukoliv pomoc. Je spousta způsobů, jak přispět

source: If you wrote anything interesting using SymPy, please send us a patch with the code (see below for more information)
cs: Pokud jste napsali cokoliv zajímavého s pomocí SymPy, prosím pošlete nám patch s tímto kódem (více informací níže)

source: If you found a bug (or just want to let us know what you think), tell us on the <a href="http://groups.google.com/group/sympy">mailinglist</a>
cs: Pokud jste objevili chybu (nebo nám jednoduše chcete dát vědět svůj názor),řekněte nám ho na<a href="http://groups.google.com/group/sympy">mailinglistu</a>

source: You can also add a bug report (or a comment) into the <a href="http://code.google.com/p/sympy/issues/list">issues</a>.
cs: Můžete také přidat hlášení chyby (nebo komentář)k <a href="http://code.google.com/p/sympy/issues/list">problémům</a>.

source: You can blog about how you use SymPy
cs: Můžete blogovat o tom, jak používáte SymPy

source: You can help us write documentation (just send us a patch)
cs: Můžete nám pomoci psát dokumentaci (stačí poslat patch)

source: You can help people on our <a href="http://groups.google.com/group/sympy">mailinglist</a>
cs: Můžete pomoci lidem v našem <a href="http://groups.google.com/group/sympy">mailinglistu</a>

source: You can help with reviewing patches
cs: Můžete pomoci s kontrolou patchů

source: You can send us patches with bug fixes or new features
cs: Můžete nám poslat patche s opravami chyb nebo novými funkcemi

source: The best way to contribute code or documentation is to send us a patch
cs: Nejlepší způsob, jak přispět ke kódu nebo k dokumentaci je posláním patche

source: How to Send a Patch
cs: Jak poslat Patch

source: The best way is to send a github pull request against the <a href="http://github.com/sympy/sympy">sympy/sympy</a> repository. We'll review it and push it in.
cs: Nejlepší způsob je poslat na github pull request na <a href="http://github.com/sympy/sympy">sympy/sympy</a> repozitář. My ho zkontrolujeme a přidáme.

source: If you need help with git, github, pull requests, patches, coding, SymPy or anything related, just send us an email to the mailinglist or ask on IRC (our channel is <a href="irc://irc.freenode.net/sympy">#sympy at freenode</a>), we'll help.
cs: Pokud potřebujete pomoci s gitem, githubem, pull requesty, patchy,vytvářením kódu, SymPy nebo čímkoliv souvisejícím, jednoduše napište email namailinglistu nebo se zeptejte na IRC (náš kanál je<a href="irc://irc.freenode.net/sympy">#sympy na freenode</a>), my pomůžeme.

source: Also, you can read our instructions <a href="https://github.com/sympy/sympy/wiki/Development-workflow"> how to prepare patches</a> using git and github.
cs: Také si můžete přečíst intrukce, <a href="https://github.com/sympy/sympy/wiki/Development-workflow">jak připravovat patche</a> s použitím gitu a githubu.

source: The github pull request is a preferred method, as that makes it easy for us to review and push the code in. That said, you can also clone the latest git repository (see the link on the right), prepare a branch with your code, upload it somewhere (for example <a href="http://github.com/">github</a>) and send us a link to the <a href="http://groups.google.com/group/sympy-patches">sympy-patches</a> mailinglist, or you can even send us raw patches --- but it will be more work for us to integrate it.
cs: Github pull request je námi preferovaný způsob, protože je pro nás jednoduchézkontrolovat a zapojit váš kód. Můžete ovšem také naklonovat nejnovějšígit repozitář (viz odkaz vpravo), připravit úsek s vaším kódem, nahrát ho někam(například na <a href="http://github.com/">github</a>) a poslat nám odkaz na<a href="http://groups.google.com/group/sympy-patches">sympy-patches</a>mailinglist nebo nám můžete dokonce poslat přímo samotný patch --- ale dá námpak více práce ho zapojit.

source: SymPy has a broad development team: <a href=" http://docs.sympy.org/0.7.1/aboutus.html#sympy-development-team "> http://docs.sympy.org/0.7.1/aboutus.html#sympy-development-team </a>, send us a patch and your name will appear there too.
cs: SymPy má početný vývojářský tým: <a href="http://docs.sympy.org/0.7.1/aboutus.html#sympy-development-team">http://docs.sympy.org/0.7.1/aboutus.html#sympy-development-team</a>, pošlete nám patch a vaše jméno se na něm také objeví.

source: Sources of the Webpages
cs: Zdrojový kód webových stránek

source: Sources of these webpages are at
cs: Zdrojový kód těchto webových stránek je na

source: Feel free to send us patches with improvements.
cs: Nezdráhejte se nám poslat patch s vylepšeními.

source: Git Repository
cs: Git Repozitář

source: Main git repository
cs: Hlavní git repozitář

source: Online access
cs: Online přístup

source: The documentation is maintained using the <a href="%(url)s">Sphinx</a> Python documentation generator.
cs: Dokumentace je udržovaná pomocí <a href="%(url)s">Sphinx</a> - Pythonský dokumentační generátor.

source: You can find it at
cs: Můžete ji najít na

source: Source Tarballs (Releases)
cs: Zdrojový kód (jednotlivá vydání)

source: at Google Code page
cs: na stránkách Google Code

source: Packages for Distributions
cs: Balíčky pro distribuce

source: Git Version
cs: Git verze

source: Browse online
cs: Hledejte online

source: About
cs: O SymPy

source: SymPy is a Python library for symbolic mathematics. It aims to become a full-featured computer algebra system (CAS) while keeping the code as simple as possible in order to be comprehensible and easily extensible. SymPy is written entirely in Python and does not require any external libraries.
cs: SymPy je knihovna jazyka Python pro symbolickou matematiku. Má za cíl stát se kompletním počítačovým algebraickým systémem (CAS, Computer algebra system) a zároveň být co nejjednodušší, aby byla pochopitelná a jednoduše rozšiřitelná. SymPy je napsaná kompletně v jazyce Python a nepotřebuje žádné externí knihovny.

source: Features
cs: Vybavení

source: SymPy core capabilities include:
cs: Základní funkce SymPy zahrnují:

source: basic arithmetics
cs: základní aritmetiku

source: basic simplification
cs: základní zjednodušování

source: like
cs: jako

source: expansion
cs: roznásobování

source: functions
cs: funkce

source: complex numbers
cs: komplexní čísla

source: differentiation
cs: derivování

source: taylor (laurent) series
cs: Taylorova (Laurentova) řada

source: substitution
cs: substituce

source: or
cs: nebo

source: arbitrary precision integers, rationals and floats
cs: libovolná přesnost celých čísel, zlomků a čísel s pohyblivou desetinnou čárkou

source: noncommutative symbols
cs: nekomutativní symboly

source: pattern matching
cs: porovnávání vzorků

source: Then there are SymPy modules for these tasks:
cs: Dále má SymPy moduly pro tyto úlohy

source: more functions (sin, cos, tan, atan, asin, acos, factorial, zeta, legendre)
cs: více funkcí (sin, cos, tan, atan, asin, acos, faktoriál, zeta, legendre)

source: limits
cs: limity

source: integration using extended Risch-Norman heuristic
cs: integrování s využitím rozšířeného Risch-Normanova algoritmu

source: polynomials (division, gcd, square free decomposition, groebner bases, factorization)
cs: polynomy (dělení, nsd, bezčtvercová dekompozice, Gröbnerova báze, faktorizace)

source: solvers (algebraic, difference and differential equations, and systems of equations)
cs: řešiče (algebraické řešiče, derivace, diferenciální rovnice a soustavy rovnic)

source: symbolic matrices (determinants, LU decomposition...)
cs: symbolické matice (determinanty, LU dekompozice...)

source: mpmath (multiprecision floating-point arithmetic)
cs: mpmath (výpočty s libovolnou přesností s pohyblivou desetinnou čárkou)

source: geometric algebra (GA)
cs: geometrická algebra (GA)

source: Pauli and Dirac algebra
cs: Pauliho a Diracova algebra

source: quantum physics
cs: kvantová fyzika

source: geometry module
cs: geometrický modul

source: plotting (2D and 3D)
cs: grafy (2D a 3D)

source: code generation (C, Fortran, LaTeX)
cs: generování kódu (C, Fortran, LaTeX)

source: Download Now
cs: Ihned stáhnout

source: Releases
cs: Jednotlivá vydání

source: Latest git version
cs: Nejnovější git verze

source: News
cs: Novinky

source: Version %(v)s released
cs: Vydaná verze %(v)s

source: changes
cs: změny

source: SymPy is accepted as a <a href="http://www.google-melange.com/gsoc/org/show/google/gsoc2011/sympy">mentoring organization</a> for Google Summer of Code 2011
cs: SymPy je přijato jako <a href="http://www.google-melange.com/gsoc/org/show/google/gsoc2011/sympy">mentorující organizace</a> pro Google Summer of Code 2011

source: New website launched at sympy.org
cs: Spuštěn nový web na sympy.org

source: Final page about the <a href="%(url)s">2009 Google Summer of Code in SymPy</a> is available.
cs: Je dostupná závěrečná stránka o <a href="%(url)s">2009 Google Summer of Code - SymPy</a>.

source: Quick Links
cs: Rychlé Odkazy

source: Downloads (source tarballs)
cs: Stáhnout (zdrojový kód tarballs)

source: Downloads (packages for distributions)
cs: Stáhnout (balíčky pro distribuce)

source: Source code
cs: Zdrojový kód

source: Issues tracker
cs: Sledování problémů

source: Google Code Page
cs: Stránka Google Code

source: Try SymPy online now
cs: Zkuste SymPy online

source: Official SymPy blog
cs: Oficiální SymPy blog

source: Planet SymPy
cs: Planeta SymPy

source: Python Session
cs: Python

source: ISymPy Session
cs: ISymPy

source: General
cs: Obecně

source: Below you can find several ways to get help
cs: Níže vidíte řadu způsobů, jak získat pomoc

source: More Specific
cs: Specifičtěji
